MESSAGE_RESET_CONTEXT = r'Запущен новый диалог'
MESSAGE_TO_RESET_CONTEXT = r'Завершить диалог...'

ERROR_RESPONSE_MESSAGE = r'В данный момент невозможно обработать Ваш запрос, повторите попытку позже.'

START_MESSAGE = "Приветствую! Я бот ChatGPT и готов отвечать на Ваши вопросы. Вот лишь небольшая часть от того с чем я могу помочь:\n" \
                "\n" \
                "- Поиск информации по любой теме;\n" \
                "- Подсказки и советы по решению задач из любой области;\n" \
                "- Помощь в написании текстов, рефератов, докладов на различные темы;\n" \
                "- Изучение иностранных языков (Перевод текстов с сохранением контекста, объяснение тем по грамматике и не только)\n" \
                "\n" \
                "По кнопке \"Завершить диалог...\" контекст сбросится и последующие сообщения будут уже в новом контексте\n"\
                "\n" \
                "Не стесняйтесь обращаться ко мне в любое время"

START_RESPONSE = "Запрос отправлен..."

SUBSCRIBER_TO_CHANNEL = "Для работы бота необходимо подписать на Telegram канал...\n\nПовторите попытку после подписки на канал."
SUBSCRIBE = "Подписаться... "
URL_TO_SUBSCRIBE = "https://t.me/HomeDigestIT"